## Plan Result (1161: nonprod_github_network - TerraformPlanApply)




<pre><code>Plan: 12 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azapi_resource.network_settings
  * module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.networking.azurerm_network_security_rule.deny_inbound[&#34;nsg&#34;]
  * module.networking.azurerm_resource_group.new[0]
  * module.networking.azurerm_route.this[&#34;rt-default&#34;]
  * module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.networking.azurerm_subnet.this[&#34;github-github&#34;]
  * module.networking.azurerm_subnet_network_security_group_association.this[&#34;nsg-github-github&#34;]
  * module.networking.azurerm_subnet_route_table_association.this[&#34;rt-github-github&#34;]
  * module.networking.azurerm_virtual_network.this[&#34;github&#34;]
  * module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target
  * module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator




<details><summary>Change Result (Click me)</summary>

```hcl

  # azapi_resource.network_settings will be created
  + resource "azapi_resource" "network_settings" {
      + body                      = {
          + properties = {
              + businessId = (sensitive value)
              + subnetId   = (known after apply)
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "uksouth"
      + name                      = "github-network-settings-stg"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hub-github-network-rg-stg"
      + response_export_values    = [
          + "tags.GitHubId",
          + "name",
        ]
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + tags                      = (known after apply)
      + type                      = "GitHub.Network/networkSettings@2024-04-02"
    }

  # module.networking.azurerm_network_security_group.this["nsg"] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "hub-github-network-nsg-stg"
      + resource_group_name = "hub-github-network-rg-stg"
      + security_rule       = (known after apply)
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/github-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.networking.azurerm_network_security_rule.deny_inbound["nsg"] will be created
  + resource "azurerm_network_security_rule" "deny_inbound" {
      + access                      = "Deny"
      + description                 = "Default DenyInbound rule"
      + destination_address_prefix  = "*"
      + destination_port_range      = "*"
      + direction                   = "Inbound"
      + id                          = (known after apply)
      + name                        = "DenyAllInbound"
      + network_security_group_name = "hub-github-network-nsg-stg"
      + priority                    = 4096
      + protocol                    = "*"
      + resource_group_name         = "hub-github-network-rg-stg"
      + source_address_prefix       = "*"
      + source_port_range           = "*"
    }

  # module.networking.azurerm_resource_group.new[0] will be created
  + resource "azurerm_resource_group" "new" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "hub-github-network-rg-stg"
      + tags     = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/github-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.networking.azurerm_route.this["rt-default"] will be created
  + resource "azurerm_route" "this" {
      + address_prefix         = "0.0.0.0/0"
      + id                     = (known after apply)
      + name                   = "rt-default"
      + next_hop_in_ip_address = "10.11.72.36"
      + next_hop_type          = "VirtualAppliance"
      + resource_group_name    = "hub-github-network-rg-stg"
      + route_table_name       = "hub-github-network-rt-stg"
    }

  # module.networking.azurerm_route_table.this["rt"] will be created
  + resource "azurerm_route_table" "this" {
      + bgp_route_propagation_enabled = true
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "hub-github-network-rt-stg"
      + resource_group_name           = "hub-github-network-rg-stg"
      + route                         = (known after apply)
      + subnets                       = (known after apply)
      + tags                          = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/github-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.networking.azurerm_subnet.this["github-github"] will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.10.231.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "hub-github-network-github-stg"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "hub-github-network-rg-stg"
      + virtual_network_name                          = "hub-github-network-github-stg"

      + delegation {
          + name = "containerapps"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "GitHub.Network/networkSettings"
            }
        }
    }

  # module.networking.azurerm_subnet_network_security_group_association.this["nsg-github-github"] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.networking.azurerm_subnet_route_table_association.this["rt-github-github"] will be created
  + resource "azurerm_subnet_route_table_association" "this" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.azurerm_virtual_network.this["github"] will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.10.231.0/24",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "uksouth"
      + name                           = "hub-github-network-github-stg"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "hub-github-network-rg-stg"
      + subnet                         = (known after apply)
      + tags                           = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/github-infra"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

  # module.vnet_peer_hub.azurerm_virtual_network_peering.initiator_to_target will be created
  + resource "azurerm_virtual_network_peering" "initiator_to_target" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub-github-network-github-stg-vnet-stg-to-hub"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hmcts-hub-nonprodi/providers/Microsoft.Network/virtualNetworks/hmcts-hub-nonprodi"
      + resource_group_name                    = "hub-github-network-rg-stg"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "hub-github-network-github-stg"
    }

  # module.vnet_peer_hub.azurerm_virtual_network_peering.target_to_initiator will be created
  + resource "azurerm_virtual_network_peering" "target_to_initiator" {
      + allow_forwarded_traffic                = true
      + allow_gateway_transit                  = false
      + allow_virtual_network_access           = true
      + id                                     = (known after apply)
      + name                                   = "hub-to-hub-github-network-github-stg-vnet-stg"
      + peer_complete_virtual_networks_enabled = true
      + remote_virtual_network_id              = "/subscriptions/fb084706-583f-4c9a-bdab-949aac66ba5c/resourceGroups/hub-github-network-rg-stg/providers/Microsoft.Network/virtualNetworks/hub-github-network-github-stg"
      + resource_group_name                    = "hmcts-hub-nonprodi"
      + use_remote_gateways                    = false
      + virtual_network_name                   = "hmcts-hub-nonprodi"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + github_id = (known after apply)
```

</details>





## :warning: Errors

* failed to add a label 1161: nonprod_github_network - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":1,"Program":"tfcmt","SHA1":"","Target":"1161: nonprod_github_network - TerraformPlanApply","Vars":{}} -->